app/Controllers/Home.php

SELECT `cesni`.*, `takozlar`.`musteri`, `takozlar`.`giris_gram`, `takozlar`.`tahmini_milyem`, `takozlar`.`olculen_milyem`, `takozlar`.`cesni_has`, `customer`.`ad` as `musteri_adi`
FROM `cesni`
JOIN `takozlar` ON `cesni`.`fis_no` = `takozlar`.`id`
LEFT JOIN `customer` ON `customer`.`id` = `takozlar`.`musteri`
WHERE `cesni`.`status_code` = 1
---
    public function ayarevi()
    {
        $model = new TakozModel();
        $modelcesni = new CesniModel();
        $hurdamodel = new HurdaModel();
        $hastakozmodel = new HasTakozModel();
        $db = \Config\Database::connect();



        // Tüm takozları veritabanından çek

        $hurdalar = $hurdamodel->where('status_code', 2)->findAll();

        // Toplam gramajı hesapla
        $hurdatotalGram = array_sum(array_column($hurdalar, 'giris_gram'));



        // status_code = 2 olan takozları al
        $items = $model->where('status_code', 2)->findAll();

        // status_code = 1 olan cesnilerle takozları joinleyelim
        $builder = $db->table('cesni');
        $builder->select('cesni.*, takozlar.musteri, takozlar.giris_gram, takozlar.tahmini_milyem,takozlar.olculen_milyem,takozlar.cesni_has');
        $builder->join('takozlar', 'cesni.fis_no = takozlar.id');
        $builder->where('cesni.status_code', 1);

        $cesnibilgi = $builder->get()->getResultArray();

SELECT `takozlar`.*, `customer`.`ad` as `musteri_adi`
FROM `takozlar`
LEFT JOIN `customer` ON `customer`.`id` = `takozlar`.`musteri`
WHERE `takozlar`.`status_code` = 3
---
    public function eritme()
    {
        $model = new TakozModel();
        $modelcesni = new CesniModel();
        $db = \Config\Database::connect();

        // status_code = 2 olan takozları al
        $items = $model->where('status_code', 3)->findAll();

        // status_code = 1 olan cesnilerle takozları joinleyelim
        $builder = $db->table('cesni');
        $builder->select('cesni.*, takozlar.musteri, takozlar.giris_gram, takozlar.tahmini_milyem,takozlar.olculen_milyem,takozlar.cesni_has');
        $builder->join('takozlar', 'cesni.fis_no = takozlar.id');
        $builder->where('cesni.status_code', 1);

        $cesnibilgi = $builder->get()->getResultArray();