app/Controllers/Home.php

    public function index()
    {
        $db = \Config\Database::connect();

        // TAKOZLAR: Customer tablosuyla join
        $builder = $db->table('takozlar');
        $builder->select('takozlar.*, customer.ad as musteri_adi');
        $builder->join('customer', 'customer.id = takozlar.musteri', 'left');
        $builder->where('takozlar.status_code', 1);
        $items = $builder->get()->getResultArray();

        // HURDALAR: Customer tablosuyla join
        $hurdaBuilder = $db->table('hurda');
        $hurdaBuilder->select('hurda.*, customer.ad as musteri_adi');
        $hurdaBuilder->join('customer', 'customer.id = hurda.musteri', 'left');
        $hurdaBuilder->where('hurda.status_code', 1);
        $hurdalar = $hurdaBuilder->get()->getResultArray();
---
SELECT `takozlar`.*, `customer`.`ad` as `musteri_adi`
FROM `takozlar`
LEFT JOIN `customer` ON `customer`.`id` = `takozlar`.`musteri`
WHERE `takozlar`.`status_code` = 1
SELECT `hurda`.*, `customer`.`ad` as `musteri_adi`
FROM `hurda`
LEFT JOIN `customer` ON `customer`.`id` = `hurda`.`musteri`
WHERE `hurda`.`status_code` = 1

    public function ayarevi()
    {
        $model = new TakozModel();
        $modelcesni = new CesniModel();
        $hurdamodel = new HurdaModel();
        $db = \Config\Database::connect();

        $reaktorModel = new ReaktorModel();
        $reaktorFireTotalModel = $reaktorModel
            ->selectSum('miktar')
            ->first();

        // TAKOZLAR: status_code=2 olanlar + customer tablosu join
        $takozBuilder = $db->table('takozlar');
        $takozBuilder->select('takozlar.*, customer.ad as musteri_adi');
        $takozBuilder->join('customer', 'customer.id = takozlar.musteri', 'left');
        $takozBuilder->where('takozlar.status_code', 2);
        $items = $takozBuilder->get()->getResultArray();

        // HURDALAR: status_code=2 olanlar + customer tablosu join
        $hurdaBuilder = $db->table('hurda');
        $hurdaBuilder->select('hurda.*, customer.ad as musteri_adi');
        $hurdaBuilder->join('customer', 'customer.id = hurda.musteri', 'left');
        $hurdaBuilder->where('hurda.status_code', 2);
        $hurdalar = $hurdaBuilder->get()->getResultArray();
---
SELECT SUM(`miktar`) AS `miktar`
FROM `reaktor`
 LIMIT 1
SELECT `hurda`.*, `customer`.`ad` as `musteri_adi`
FROM `hurda`
LEFT JOIN `customer` ON `customer`.`id` = `hurda`.`musteri`
WHERE `hurda`.`status_code` = 2

        $hastakozBuilder->select('takozlar.*, customer.ad as musteri_adi');
        $hastakozBuilder->join('customer', 'customer.id = takozlar.musteri', 'left');
        $hastakozBuilder->where('takozlar.status_code', 5);
        $hastakozlar = $hastakozBuilder->get()->getResultArray();
---
SELECT `takozlar`.*, `customer`.`ad` as `musteri_adi`
FROM `takozlar`
LEFT JOIN `customer` ON `customer`.`id` = `takozlar`.`musteri`
WHERE `takozlar`.`status_code` = 5

    public function inceleTakozKasa()
    {
        $data = $this->request->getJSON(true);
        $id = $data['id'] ?? null;

        if (!$id) {
            return $this->response->setStatusCode(400)->setBody("Geçersiz ID.");
        }

        $db = \Config\Database::connect();
        $takozModel = new \App\Models\TakozModel();
        $hurdaModel = new \App\Models\HurdaModel();


        $takoz = $takozModel->find($id);

        if (!$takoz) {
            return $this->response->setBody("Kayıt bulunamadı.");
        }


        // Grup yoksa veya tek işlemse sadece kendi kaydını getir
        $builder = $db->table('takozlar');
        $builder->select('takozlar.*, customer.ad as musteri_adi');
        $builder->join('customer', 'customer.id = takozlar.musteri', 'left');
        $builder->where('takozlar.id', $id);
        $gecmis = $builder->get()->getResultArray();
---
SELECT `takozlar`.*, `customer`.`ad` as `musteri_adi`
FROM `takozlar`
LEFT JOIN `customer` ON `customer`.`id` = `takozlar`.`musteri`
WHERE `takozlar`.`id` = 377

                $hurdaBuilder->select('hurda.*, customer.ad as musteri_adi');
                $hurdaBuilder->join('customer', 'customer.id = hurda.musteri', 'left');
                $hurdaBuilder->where('hurda.id', $t['hurda_grup_kodu']);
                $hurda = $hurdaBuilder->get()->getRowArray();
---
SELECT `hurda`.*, `customer`.`ad` as `musteri_adi`
FROM `hurda`
LEFT JOIN `customer` ON `customer`.`id` = `hurda`.`musteri`
WHERE `hurda`.`id` = '52'

    public function ayarBakmaView()
    {
        $db = \Config\Database::connect();

        // Takozlar: status_code=4, hurda_grup_kodu <=0, tur=0, müşteri adı ile birlikte
        $builder = $db->table('takozlar');
        $builder->select('takozlar.*, customer.ad as musteri_adi,customer.oran');
        $builder->join('customer', 'customer.id = takozlar.musteri', 'left');
        $builder->whereIn('takozlar.status_code', [1, 2, 3, 4, 8]);
        //$builder->where('takozlar.hurda_grup_kodu <=', 0);
        //$builder->where('takozlar.tur', 0);
        $builder->whereIn('takozlar.tur', [35]);
        $builder->orderBy('takozlar.id', 'DESC');
        $items = $builder->get()->getResultArray();
---
SELECT `takozlar`.*, `customer`.`ad` as `musteri_adi`, `customer`.`oran`
FROM `takozlar`
LEFT JOIN `customer` ON `customer`.`id` = `takozlar`.`musteri`
WHERE `takozlar`.`status_code` IN (1,2,3,4,8)
AND `takozlar`.`tur` IN (35)
ORDER BY `takozlar`.`id` DESC