app/Controllers/Home.php

    public function index()
    {
        // Modeli yükleyelim

        $model = new TakozModel();
        $hurdamodel = new HurdaModel();
        // Tüm takozları veritabanından çek
        $items = $model->where('status_code', 1)->findAll();
        $hurdalar = $hurdamodel->where('status_code', 1)->findAll();
---
SELECT *
FROM `hurda`
WHERE `status_code` = 1

    public function ayarevi()
    {
        $model = new TakozModel();
        $modelcesni = new CesniModel();
        $hurdamodel = new HurdaModel();
        $db = \Config\Database::connect();



        // Tüm takozları veritabanından çek

        $hurdalar = $hurdamodel->where('status_code', 2)->findAll();

        // Toplam gramajı hesapla
        $hurdatotalGram = array_sum(array_column($hurdalar, 'giris_gram'));



        // status_code = 2 olan takozları al
        $items = $model->where('status_code', 2)->findAll();

        // status_code = 1 olan cesnilerle takozları joinleyelim
        $builder = $db->table('cesni');
        $builder->select('cesni.*, takozlar.musteri, takozlar.giris_gram, takozlar.tahmini_milyem,takozlar.olculen_milyem,takozlar.cesni_has');
        $builder->join('takozlar', 'cesni.fis_no = takozlar.id');
        $builder->where('cesni.status_code', 1);

        $cesnibilgi = $builder->get()->getResultArray();
---
SELECT *
FROM `hurda`
WHERE `status_code` = 2
SELECT `takozlar`.*, `customer`.`ad` as `musteri_adi`
FROM `takozlar`
LEFT JOIN `customer` ON `customer`.`id` = `takozlar`.`musteri`
WHERE `takozlar`.`status_code` = 2
SELECT `cesni`.*, `takozlar`.`musteri`, `takozlar`.`giris_gram`, `takozlar`.`tahmini_milyem`, `takozlar`.`olculen_milyem`, `takozlar`.`cesni_has`
FROM `cesni`
JOIN `takozlar` ON `cesni`.`fis_no` = `takozlar`.`id`
WHERE `cesni`.`status_code` = 1

    public function eritme()
    {
        $model = new TakozModel();
        $modelcesni = new CesniModel();
        $db = \Config\Database::connect();

        // status_code = 2 olan takozları al
        $items = $model->where('status_code', 3)->findAll();

        // status_code = 1 olan cesnilerle takozları joinleyelim
        $builder = $db->table('cesni');
        $builder->select('cesni.*, takozlar.musteri, takozlar.giris_gram, takozlar.tahmini_milyem,takozlar.olculen_milyem,takozlar.cesni_has');
        $builder->join('takozlar', 'cesni.fis_no = takozlar.id');
        $builder->where('cesni.status_code', 1);

        $cesnibilgi = $builder->get()->getResultArray();
---
SELECT *
FROM `takozlar`
WHERE `status_code` = 3
SELECT `cesni`.*, `takozlar`.`musteri`, `takozlar`.`giris_gram`, `takozlar`.`tahmini_milyem`, `takozlar`.`olculen_milyem`, `takozlar`.`cesni_has`
FROM `cesni`
JOIN `takozlar` ON `cesni`.`fis_no` = `takozlar`.`id`
WHERE `cesni`.`status_code` = 1

    public function kasaHesap()
    {

        $model = new TakozModel();
        $hurdamodel = new HurdaModel();
        // Tüm takozları veritabanından çek
        $items = $model->where('status_code', 4)
            ->where('hurda_grup_kodu <=', 0)
            ->where('tur =', 0)
            ->findAll();
        $hurdalar = $hurdamodel->where('status_code', 1)->findAll();
---
SELECT *
FROM `hurda`
WHERE `status_code` = 1

    public function inceleCesni()
    {
        $data = $this->request->getJSON(true); // fetch ile JSON geldiği için
        $id = $data['id'] ?? null;

        if (!$id) {
            return $this->response->setStatusCode(400)->setBody("Geçersiz ID.");
        }

        $cesniModel = new \App\Models\CesniModel();
        $takozModel = new \App\Models\TakozModel();
        $hurdaModel = new \App\Models\HurdaModel();
        // 1. Seçilen çeşniyi bul
        $cesni = $cesniModel->find($id);
---
SELECT *
FROM `cesni`
WHERE `cesni`.`id` = 48

        $cacheHurdaGrupKodu=0;
        foreach ($gecmis as $t) {
            if (!empty($t['hurda_grup_kodu']) && $t['hurda_grup_kodu'] > 0) {
                $hurda = $hurdaModel->find($t['hurda_grup_kodu']);
---
SELECT *
FROM `hurda`
WHERE `hurda`.`id` = '14'

        $toplamTakoz = 0;
        foreach ($gecmis as $t) {
            if (!empty($t['hurda_grup_kodu']) && $t['hurda_grup_kodu'] > 0) {
                $hurda = $hurdaModel->find($t['hurda_grup_kodu']);
---
SELECT *
FROM `hurda`
WHERE `hurda`.`id` = '24'

    public function islenecek()
    {
        $model = new TakozModel();
        $modelcesni = new CesniModel();
        $db = \Config\Database::connect();

        // status_code = 2 olan takozları al
        $items = $model->where('status_code', 6)->findAll();

        // status_code = 1 olan cesnilerle takozları joinleyelim
        $builder = $db->table('cesni');
        $builder->select('cesni.*, takozlar.musteri, takozlar.giris_gram, takozlar.tahmini_milyem,takozlar.olculen_milyem,takozlar.cesni_has');
        $builder->join('takozlar', 'cesni.fis_no = takozlar.id');
        $builder->where('cesni.status_code', 1);

        $cesnibilgi = $builder->get()->getResultArray();
---
SELECT *
FROM `takozlar`
WHERE `status_code` = 6
SELECT `cesni`.*, `takozlar`.`musteri`, `takozlar`.`giris_gram`, `takozlar`.`tahmini_milyem`, `takozlar`.`olculen_milyem`, `takozlar`.`cesni_has`
FROM `cesni`
JOIN `takozlar` ON `cesni`.`fis_no` = `takozlar`.`id`
WHERE `cesni`.`status_code` = 1