app/Controllers/LoginController.php

SELECT *
FROM `users`
WHERE `name` = 'ubeydullah'
 LIMIT 1
---
    public function login()
    {
        $session = session();
        $model = new UserModel();

        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Kullanıcıyı username'e göre bul
        $user = $model->where('name', $username)->first();