app/Controllers/ReaktorFireTakipController.php

    public function reaktorFireTakipView2()
    {
        $db = \Config\Database::connect();

        // TAKOZLAR
        $builder = $db->table('takozlar');
        $builder->select('takozlar.*, customer.ad as musteri_adi, customer.oran');
        $builder->join('customer', 'customer.id = takozlar.musteri', 'left');
        $builder->whereIn('takozlar.status_code', [1, 2, 3, 4,5,6]); //5 ve 6 hastakoz getirmek için
        $builder->whereIn('takozlar.tur', [0,2,3, 15, 25]); //2 ve 3 hastakoz getirmek için
        $builder->orderBy('takozlar.id', 'DESC');
        $items = $builder->get()->getResultArray();

        // HURDALAR
        $hurdaBuilder = $db->table('hurda');
        $hurdaBuilder->select('hurda.*, customer.ad as musteri_adi');
        $hurdaBuilder->join('customer', 'customer.id = hurda.musteri', 'left');
        $hurdaBuilder->where('hurda.status_code', 1);
        $hurdaBuilder->orderBy('hurda.id', 'DESC');
        $hurdalar = $hurdaBuilder->get()->getResultArray();
---
SELECT `takozlar`.*, `customer`.`ad` as `musteri_adi`, `customer`.`oran`
FROM `takozlar`
LEFT JOIN `customer` ON `customer`.`id` = `takozlar`.`musteri`
WHERE `takozlar`.`status_code` IN (1,2,3,4,5,6)
AND `takozlar`.`tur` IN (0,2,3,15,25)
ORDER BY `takozlar`.`id` DESC
SELECT `hurda`.*, `customer`.`ad` as `musteri_adi`
FROM `hurda`
LEFT JOIN `customer` ON `customer`.`id` = `hurda`.`musteri`
WHERE `hurda`.`status_code` = 1
ORDER BY `hurda`.`id` DESC

        if (!empty($grupKodlari)) {
            $reaktorQuery = $db->table('reaktor');
            $reaktorQuery->whereIn('fis_no', $grupKodlari);
            $result = $reaktorQuery->get()->getResultArray();
---
SELECT *
FROM `reaktor`
WHERE `fis_no` IN (9,8,7,6,5,4,3,2,1)

        // 🔥 REAKTOR_FIRE TABLOSU BİLGİLERİ
        $rfBuilder = $db->table('reaktor_fire');
        $rfBuilder->select('*');
        $reaktorFire = $rfBuilder->get()->getResultArray();
---
SELECT *
FROM `reaktor_fire`